Autodesk.Aec.ApplicationServices.AecApplicationVersion
This class holds the abstraction of the version information.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.#ctor(Autodesk.Aec.ApplicationServices.AppDbxconst)
Initializes a new instance of the AecApplicationVersion class using the specified ?.
app: ?

Autodesk.Aec.ApplicationServices.AecApplicationVersion.Base
Returns the verison of AecBase.dbx.
Returns: The version of AecBase.dbx.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.Specific(System.Int16,System.Int16,System.Int16,System.Int16)
Static "factory" method that creates an object from four specific unsigned 16-bit values.
major: The major number.
minor: The minor number.
buildMajor: The build major number.
buildMinor: The build minor number.
Returns: A new instance of application version.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.Older(System.Int16,System.Int32)
Constructs a version from two numbers (pre-2010 style)
version: The version.
actual: The actual number.
Returns: A new instance of application version.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.DwgInFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
Reads the object in from a filer.
filer: The filer used for reading the object.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.DwgOutFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
Files out the object.
filer: The filer used for writing out the object.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.Major
Get the major number.
Returns: The major number.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.Minor
Gets the minor number.
Returns: The minor number.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.BuildMajor
Gets the build major.
Returns: The build major.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.BuildMinor
Gets the build minor.
Returns: The build minor.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.op_Equality(Autodesk.Aec.ApplicationServices.AecApplicationVersion)
Compares the application version with the other.
other: The other application verison passed in.
Returns: The boolean value if the application version is equal to the other.

Autodesk.Aec.ApplicationServices.AecApplicationVersion.op_LessThan(Autodesk.Aec.ApplicationServices.AecApplicationVersion,Autodesk.Aec.ApplicationServices.AecApplicationVersion)
Operator "less-than". Compares each component and if equal, the next one, and so on.
one: One of the application versions passed in.
other: The other application version passed in.
Returns: The boolean value if the application version is less than the other.