Autodesk.Aec.DatabaseServices.Listener
Represents a ?.

Autodesk.Aec.DatabaseServices.Listener.#ctor
Initializes a new instance of the Listener class.

Autodesk.Aec.DatabaseServices.Listener.#ctor(System.Boolean)
Initializes a new instance of the Listener class.
sendObjectAppendedAndErasedNotifications: Specify whether to receive object appended/Erased notifications.

Autodesk.Aec.DatabaseServices.Listener.addClassParam(Autodesk.AutoCAD.Runtime.RXClass,System.Int32)
Specify the individual parameter of a specified class, when it's modified, will trigger a notification to this listener.
type: Input the type of the class to listen for changes.
parameterId: Input the id of the parameter, which should be defined in class type.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Listener.addClassParam(System.Int32,Autodesk.AutoCAD.Runtime.RXClass)
Specify the individual parameter of a specified class, when it's modified, will trigger a notification to this listener.
parameterId: Input the id of the parameter, which should be defined in class type.
type: Input the type of the class to listen for changes.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Listener.addClassToNotify(Autodesk.AutoCAD.Runtime.RXClass)
Specify the class type which is supposed to notify.
type: The class type which is supposed to notify.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Listener.addClassNotToNotify(Autodesk.AutoCAD.Runtime.RXClass)
Specify the class type which is not supposed to notify.
type: The class type which is not supposed to notify.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Listener.allowByClass(Autodesk.AutoCAD.Runtime.RXClass)
Check whether this input class type is allowed to notify.
type: The input class type to check with.

Autodesk.Aec.DatabaseServices.Listener.Enabled
Check whether this listener is enabled.