Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddCustomInformationNode(System.IntPtr,System.Boolean)
Adds the custom information node specified by the GsMarker to the tree.
value: The specified GsMarker.
pushIntoCurrentNodeStack: The boolean value indicates if the node should be pushed into the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.InformationNodeForGsMarkerAndInformationType(System.IntPtr,Autodesk.AutoCAD.Runtime.RXClass,System.Boolean)
Gets the information node specified by the GsMarker and the information type.
value: The specified GsMarker value.
nodeType: The specified class type.
doIsKindOfTest: The boolean value indicates if the test on the type should be done.
Returns: The specified information node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.SetParentCustomBlockOwnerInformation(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.IntPtr)
Sets the parent of the custom block owner information.
id: The specified object id of the parent.
customBlockGsMarker: The GsMarker of the custom block.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.GetViewportIdFromViewportNode(System.IntPtr)
Gets the object id of the specified viewport.
gsMarker: The specified GsMarker.
Returns: The object id of the specified viewport.
Throws Autodesk.AutoCAD.Runtime.Exception: The exception is thrown if the specified viewport is not found.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.GetViewportNumberFromViewportNode(System.IntPtr)
Gets the view port number from the viewport node.
gsMarker: The specified GsMarker.
Returns: The view port number.
Throws Autodesk.AutoCAD.Runtime.Exception: The exception is thrown if the specified viewport is not found.