Autodesk.Aec.DatabaseServices.AnchorToReference.IsReferencedNested(Autodesk.Aec.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.Aec.DatabaseServices.RelationType@)
Determines whether the specified entity is referenced.
aecId: The entity.
db: The database.
relationType: The type of relation.
Returns: Returns true if the specified entity is referenced.

Autodesk.Aec.DatabaseServices.AnchorToReference.AppendNestedReferenceObject(Autodesk.Aec.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.Aec.DatabaseServices.RelationType)
Adds the passed in object as a reference of this anchor.
aecId: The referenced object.
db: The database.
relationType: The type of relation.

Autodesk.Aec.DatabaseServices.AnchorToReference.RemoveNestedReferenceObject(Autodesk.Aec.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Database)
Removes the passed in id from the list of references.
aecId: The referenced object.
db: The database.

Autodesk.Aec.DatabaseServices.AnchorToReference.GetNestedReferenceObjectAt(System.Int32,Autodesk.Aec.DatabaseServices.RelationType@)
Determines the referenced object and relation type at the current index.
index: The index of the referenced object.
relationType: The type of relation.
Returns: Returns the referenced object and relation type at the current index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.AnchorToReference.GetNestedSingleReference(Autodesk.Aec.DatabaseServices.RelationType@)
Specifies the first referenced object and its relation type.
relationType: The type of relation.
Returns: Returns the first referenced object and its relation type.
Remarks: Returns null and NotApplicable if there is no referenced object.

Autodesk.Aec.DatabaseServices.AnchorToReference.SetNestedSingleReference(Autodesk.Aec.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.Aec.DatabaseServices.RelationType)
Sets one reference to the specified object.
aecId: The referenced object Id.
db: The database.
relationType: The type of relation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.