Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.ProgressiveUpdateCondition
Gets or sets current progressive update condition setups, which will disable the progressive update.
Returns: Returns current progressive update condition setups, which will disable the progressive update.