Autodesk.Aec.ApplicationServices.DatabaseDataManagerDictionary
Represents a database data manager dictionary.

Autodesk.Aec.ApplicationServices.DatabaseDataManagerDictionary.RegisterPacketType(System.String,Autodesk.AutoCAD.Runtime.RXClass)
Register the specified packet class type with the specified key name.
keyName: The specified key name.
packetClassType: The specified packet class type.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.ApplicationServices.DatabaseDataManagerDictionary.UnRegisterPacketType(System.String)
Unregister the specifed packet class type associated with the specified key name.
keyName: The specified key name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.ApplicationServices.DatabaseDataManagerDictionary.GetManager(System.String)
Gets the database data manager associated with the specified key name.
keyName: The specified key name.
Returns: The database data manager.

Autodesk.Aec.ApplicationServices.DatabaseDataManagerDictionary.GetManagers
Gets the managers.
managers: The managers.