Autodesk.Aec.ApplicationServices.DatabaseData
Represents a database data.

Autodesk.Aec.ApplicationServices.DatabaseData.#ctor
Initializes a new instance of the DatabaseData class.

Autodesk.Aec.ApplicationServices.DatabaseData.Database
Gets the database associated with the database data.
Returns: The database associated with the database data.

Autodesk.Aec.ApplicationServices.DatabaseData.DrawingInitedAndPromoted
Gets or sets the boolean value if the drawing is inited and prompted.
Returns: The boolean value if the drawing is inited and prompted.