Autodesk.Aec.DatabaseServices.StreamAcad.PushGsMarker(System.IntPtr)
Pushes the specified GsMarker onto the GsMarker stack.
id: The specified GsMarker.

Autodesk.Aec.DatabaseServices.StreamAcad.EnablePushPopXform
Gets or sets the boolean value to indicate if push/popXform is enable.
Returns: The boolean value indicates if push/popXform is enable.

Autodesk.Aec.DatabaseServices.StreamAcad.UseBodyInternalDeviation
Gets or sets the boolean value to indicate if push/popXform is enable.
Returns: The boolean value indicates if push/popXform is enable.