Autodesk.Aec.DatabaseServices.StreamIntersect.#ctor(Autodesk.AutoCAD.DatabaseServices.Database,System.IntPtr)
Initializes a new instance of the StreamIntersect class using the specified database and GS marker type.
db: The specified database.
gsMarker: The specified GS marker type.