Autodesk.Aec.ApplicationServices.Preferences.GetEnableProgressiveUpdate(System.Boolean)
Gets whether the progressive update function is enabled.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the progressive update function is enabled.

Autodesk.Aec.ApplicationServices.Preferences.SetEnableProgressiveUpdate(System.Boolean,System.Boolean,System.Boolean)
Sets whether the progressive update function is enabled.
enabled: Boolean value indicates whether the progressive update function is enabled.
updateVar: Boolean value indicates whether to update the runtime variable.
updateReg: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.EnableProgressiveUpdate
Gets or sets whether the progressive update function is enabled in the registry table.
Returns: Boolean value indicates whether the progressive update function is enabled.