Autodesk.Aec.Modeler.Face.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.Aec.Modeler.PolygonVertexData[],System.Int32,Autodesk.AutoCAD.Geometry.Vector3d,System.Int32,System.Boolean,Autodesk.Aec.Modeler.Body)
Creates a face from polygon data.
points: Input the points of the profile polygon.
vertexData: Input the vertices data of profile polygon.
numberOfVertices: Input the number of vertices.
polygonNormal: Input the polygon normal vector to determine the orientation of arcs.
type: Input the direction type.
checkPlanarity: Input the check planarity.
body: Input the body.