Autodesk.Aec.DatabaseServices.ParameterChangeListenerManager
Represents a Listener Manager.

Autodesk.Aec.DatabaseServices.ParameterChangeListenerManager.#ctor
Initializes a new instance of the ParameterChangeListenerManager class.

Autodesk.Aec.DatabaseServices.ParameterChangeListenerManager.RegisterListener(Autodesk.Aec.DatabaseServices.Listener)
Registers the listener.
pListener: The input listener.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ParameterChangeListenerManager.UnRegisterListener(Autodesk.Aec.DatabaseServices.Listener)
Unregisters the listener.
listener: The input listener.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.