Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.InformationNodeForGsMarker(System.IntPtr)
Gets the node specified by the GsMarker in the children nodes set.
value: The specified GsMarker.
Returns: The node specified by the GsMarker.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.InformationNodesForGsMarker(System.IntPtr)
Gets all nodes specified by the GsMarker in the children nodes set.
value: The specified GsMarker.
Returns: All nodes specified by the GsMarker.