Autodesk.Aec.ApplicationServices.DatabaseDataManager
Represents a Database data manager.

Autodesk.Aec.ApplicationServices.DatabaseDataManager.GetDatabaseData(Autodesk.AutoCAD.DatabaseServices.Database)
Get the Database data associated with the specified database.
database: The specified database.
Returns: The database data corresponding to the specified database.

Autodesk.Aec.ApplicationServices.DatabaseDataManager.GetAllDatabaseData
Get all dtabase data.
Returns: The database data pointers.